LINKS = [
    {
        "Название": "Россия – страна возможностей",
        "Описание": "Самые разные проекты и конкурсы, онлайн-курсы, стажировки",
        "Перейти": "https://rsv.ru/",
    },
    {
        "Название": "Росмолодежь",
        "Описание": "Самые разные проекты, онлайн-курсы, стажировки, грантовые конкурсы",
        "Перейти": "https://grants.myrosmol.ru/",
    },
    {
        "Название": "Добро.РФ",
        "Описание": "Платформа, где можно поволонтерить на самых разных проектах. От городских до международных. Дают волонтерские часы",
        "Перейти": "https://dobro.ru/",
    },
    {
        "Описание": "Программа позволяющая путешествовать бесплатно",
        "Название": "Больше, чем путешествие",
        "Перейти": "https://morethantrip.ru/main",
    },
    {
        "Название": "Таврида.АРТ",
        "Описание": "Проект для творческой молодежи с круглогодичными очными программами в Крыму",
        "Перейти": "https://tavrida.art/",
    },
    {
        "Название": "Твой Ход",
        "Описание": "Проект, помогающий продвинуть своё дело и получить денежную поддержку. Также есть направления наставничества и стажировок",
        "Перейти": "https://tvoyhod.online/",
    },
    {
        "Название": "Другое дело",
        "Описание": "Проект-агрегатор, который собирает добрые, полезные, развивающие и интересные дела, за выполнение которых ты получаешь баллы, которые можешь обменять на ценные призы",
        "Перейти": "https://drugoedelo.ru/",
    },
    {
        "Название": "ТопБлог",
        "Описание": "Проект, помогающий развивать блоги",
        "Перейти": "https://topblog.rsv.ru/",
    },
    {
        "Название": "Большая перемена",
        "Описание": "Конкурс, в котором школьники могут выиграть до миллиона рублей",
        "Перейти": "https://bolshayaperemena.online/",
    },
    {
        "Название": "Mobile-university",
        "Описание": "Бесплатные курсы на самые разные темы",
        "Перейти": "https://m-university.ru/courses/all",
    },
    {
        "Название": "Лифт в будущее",
        "Описание": "Стажировки и стипендиальна программа",
        "Перейти": "https://lift-bf.ru/",
    },
    {
        "Название": "Росмолодежь.Форумы",
        "Описание": "Самые главные форумы нашей страны",
        "Перейти": "https://events.myrosmol.ru/",
    },
    {
        "Название": "Российское общество Знание",
        "Описание": "Онлайн- и офлайн-курсы и лекции от известных людей",
        "Перейти": "https://znanierussia.ru/projects",
    },
    {
        "Название": "Young&&Yandex",
        "Описание": "Мероприятия и стажировки от Яндекса",
        "Перейти": "https://yandex.ru/yaintern/",
    },
    {
        "Название": "Leader ID",
        "Описание": "Самые разные проекты. Часто бывают интересные экспедиции",
        "Перейти": "https://leader-id.ru/events",
    },
    {
        "Название": "Я - Профессионал",
        "Описание": "Олимпиада с крутыми закрытыми форумами для участников",
        "Перейти": "https://yandex.ru/profi",
    },
    {
        "Название": "VK Education",
        "Описание": "Стажировки, ваканисии и курсы от VK",
        "Перейти": "https://internship.vk.company/",
    },
    {
        "Название": "ArtMasters",
        "Описание": "Чемпионат творческих компетенций",
        "Перейти": "https://artmasters.ru/",
    },
]


async def get_links() -> list[dict[str, str]]:
    return LINKS
